#+TITLE: Audio Signal Processing for Music Applications
#+DATE: <2015-09-24 Thu>

by Prof Xavier Serra, Prof Julius O Smith, III

 [[https://class.coursera.org/audio-002/][link]]

** 09 Spectral Model Synthesizer (sms) tools

Some functions need to be compiled to c

#+BEGIN_SRC shell
cd sms-tools/software/models/utilFunctions_C
python compileModule.py build_ext --inplace
#+END_SRC

#+RESULTS:
| running        | build_ext                         |             |                |                  |                                  |                       |                                                   |                                                    |         |     |                                                                                                                 |                     |                                                                                 |                                                                                                              |                                                                                 |    |                  |    |                                                    |
| skipping       | 'cutilFunctions.c'                | Cython      | extension      | (up-to-date)     |                                  |                       |                                                   |                                                    |         |     |                                                                                                                 |                     |                                                                                 |                                                                                                              |                                                                                 |    |                  |    |                                                    |
| building       | 'utilFunctions_C'                 | extension   |                |                  |                                  |                       |                                                   |                                                    |         |     |                                                                                                                 |                     |                                                                                 |                                                                                                              |                                                                                 |    |                  |    |                                                    |
| creating       | build                             |             |                |                  |                                  |                       |                                                   |                                                    |         |     |                                                                                                                 |                     |                                                                                 |                                                                                                              |                                                                                 |    |                  |    |                                                    |
| creating       | build/temp.macosx-10.9-x86_64-2.7 |             |                |                  |                                  |                       |                                                   |                                                    |         |     |                                                                                                                 |                     |                                                                                 |                                                                                                              |                                                                                 |    |                  |    |                                                    |
| /usr/bin/clang | -fno-strict-aliasing              | -fno-common | -dynamic       | -pipe            | -Os                              | -fwrapv               | -DNDEBUG                                          | -g                                                 | -fwrapv | -O3 | -Wall                                                                                                           | -Wstrict-prototypes | -I/opt/local/Library/Frameworks/Python.framework/Versions/2.7/include/python2.7 | -I/opt/local/Library/Frameworks/Python.framework/Versions/2.7/lib/python2.7/site-packages/numpy/core/include | -I/opt/local/Library/Frameworks/Python.framework/Versions/2.7/include/python2.7 | -c | utilFunctions.c  | -o | build/temp.macosx-10.9-x86_64-2.7/utilFunctions.o  |
| /usr/bin/clang | -fno-strict-aliasing              | -fno-common | -dynamic       | -pipe            | -Os                              | -fwrapv               | -DNDEBUG                                          | -g                                                 | -fwrapv | -O3 | -Wall                                                                                                           | -Wstrict-prototypes | -I/opt/local/Library/Frameworks/Python.framework/Versions/2.7/include/python2.7 | -I/opt/local/Library/Frameworks/Python.framework/Versions/2.7/lib/python2.7/site-packages/numpy/core/include | -I/opt/local/Library/Frameworks/Python.framework/Versions/2.7/include/python2.7 | -c | cutilFunctions.c | -o | build/temp.macosx-10.9-x86_64-2.7/cutilFunctions.o |
| /usr/bin/clang | -bundle                           | -undefined  | dynamic_lookup | -L/opt/local/lib | -Wl,-headerpad_max_install_names | -L/opt/local/lib/db48 | build/temp.macosx-10.9-x86_64-2.7/utilFunctions.o | build/temp.macosx-10.9-x86_64-2.7/cutilFunctions.o | -lm     | -o  | /Users/kanzeon/Projects/courses/coursera-audio-002/sms-tools/software/models/utilFunctions_C/utilFunctions_C.so |                     |                                                                                 |                                                                                                              |                                                                                 |    |                  |    |                                                    |

